Examinator/src/InformationRegisters/АвтоматическиеРассылкиСУО/АвтоматическиеРассылкиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтоматическиеРассылкиСУО</name>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщенияАдминистратору</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщенияПреподавателям</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщенияОрганизаторам</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Администратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АльтернативныйШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>АльтернативнаяЭлектроннаяПочта</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.ОрганизаторыСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтборПользователей</name>
    <type>
      <types>CatalogRef.ОтборыПользователейСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВозвратаНаДоработку</name>
    <type>
      <types>CatalogRef.ПричиныВозвратаЗаданияНаДоработкуСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыАвтоматическихРассылокСУО/ТипыАвтоматическихРассылокСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАвтоматическихРассылокСУО</name>
  <enumValues>
    <name>ПриЗачисленииНаМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ПриЗачисленииНаПрограммуОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриНачалеПрохожденияМероприятия</name>
  </enumValues>
  <enumValues>
    <name>ПриНачалеПрохожденияПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрохожденияМероприятия</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрохожденияПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриглашениеНаОткрытоеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ПриглашениеНаОткрытуюПрограммуОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриНазначенииПреподавателяНаМероприятие</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНепрочитанныхЛичныхСообщений</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНепрочитанныхТемФорума</name>
  </enumValues>
  <enumValues>
    <name>ПриОтправкеЗаданияНаПроверку</name>
  </enumValues>
  <enumValues>
    <name>ВажнаяНовость</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеПароля</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияНовогоПользователя</name>
  </enumValues>
  <enumValues>
    <name>ПередОкончаниемДоступаКБазе</name>
  </enumValues>
  <enumValues>
    <name>ПриОбновленииОтбораПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПослеПроверкиЗаданияПреподавателем</name>
  </enumValues>
  <enumValues>
    <name>ПослеВозвратаНаДоработкуЗадания</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/КаталогПрограммОбученияСУО/КаталогПрограммОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПрограммОбученияСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРазработки</name>
    <type>
      <types>EnumRef.СтатусыРазработкиОбъектовСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/АвтоматическиеРассылкиСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// ЗАПИСЬ

Функция АвтоматическаяРассылка(
	Знач ТипАвтоРассылки,
	Знач ВидМероприятия = Неопределено,
	Знач Мероприятие = Неопределено,
	Знач ПрограммаОбучения = Неопределено,
	Знач ПроведениеОбучения = Неопределено,
	Знач Организаторы = Неопределено,
	Знач ОтборыПользователей = Неопределено,
	Знач ПричинаВозвратаНаДоработку = Неопределено,
	Знач ПроведениеПрограммыОбучения = Неопределено) Экспорт
	
	// Выбираем все рассылки подходящего типа
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоматическиеРассылкиСУО.ВидМероприятия,
		|	АвтоматическиеРассылкиСУО.Мероприятие,
		|	АвтоматическиеРассылкиСУО.ПрограммаОбучения,
		|	АвтоматическиеРассылкиСУО.Шаблон,
		|	АвтоматическиеРассылкиСУО.ШаблонСообщенияАдминистратору,
		|	АвтоматическиеРассылкиСУО.Администратор,
		|	АвтоматическиеРассылкиСУО.ТолькоЭлектроннаяПочта,
		|	АвтоматическиеРассылкиСУО.ШаблонСообщенияПреподавателям,
		|	АвтоматическиеРассылкиСУО.ПроведениеОбучения,
		|	АвтоматическиеРассылкиСУО.Организатор,
		|	АвтоматическиеРассылкиСУО.ШаблонСообщенияОрганизаторам,
		|	АвтоматическиеРассылкиСУО.ОтборПользователей,
		|	АвтоматическиеРассылкиСУО.КоличествоЧасов,
		|	АвтоматическиеРассылкиСУО.АльтернативныйШаблон,
		|	АвтоматическиеРассылкиСУО.АльтернативнаяЭлектроннаяПочта,
		|	АвтоматическиеРассылкиСУО.ПричинаВозвратаНаДоработку,
		|	АвтоматическиеРассылкиСУО.ПрикреплятьФайлы,
		|	АвтоматическиеРассылкиСУО.ПроведениеПрограммыОбучения,
		|	АвтоматическиеРассылкиСУО.Тип
		|ИЗ
		|	РегистрСведений.АвтоматическиеРассылкиСУО КАК АвтоматическиеРассылкиСУО
		|ГДЕ
		|	АвтоматическиеРассылкиСУО.Тип = &Тип
		|	И АвтоматическиеРассылкиСУО.Организатор В(&Организаторы)
		|	И АвтоматическиеРассылкиСУО.ОтборПользователей В(&ОтборыПользователей)
		|	И &ОтборПричинаВозвратаНаДоработку";

	Запрос.УстановитьПараметр("Тип", ТипАвтоРассылки);

	// Устанавливаем условие по организаторам
	
	ОрганизаторыДляПоиска = Новый Массив;
	
	Если Организаторы = Неопределено Тогда		
		ОрганизаторыДляПоиска.Добавить(Справочники.ОрганизаторыСУО.ПустаяСсылка()); // Без организатора
	КонецЕсли;
	
	Если ТипЗнч(Организаторы) = Тип("Массив") Тогда
		
		// Если передаем организаторов, то пустого не ищем,
		// т.е. его следует передать в функцию в массиве,
		// чтобы учесть рассылки без организаторов.
		
		Для каждого Организатор Из Организаторы Цикл
			
			Если ОрганизаторыДляПоиска.Найти(Организатор) = Неопределено Тогда
				ОрганизаторыДляПоиска.Добавить(Организатор);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Организаторы) = Тип("СправочникСсылка.ОрганизаторыСУО") Тогда
		ОрганизаторыДляПоиска.Добавить(Организаторы);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организаторы", ОрганизаторыДляПоиска);
	
	// Устанавливаем условие по отборам пользователей
	
	ОтборыПользователейДляПоиска = Новый Массив;
	
	Если ОтборыПользователей = Неопределено Тогда		
		ОтборыПользователейДляПоиска.Добавить(Справочники.ОтборыПользователейСУО.ПустаяСсылка());		
	КонецЕсли;
	
	Если ТипЗнч(ОтборыПользователей) = Тип("СправочникСсылка.ОтборыПользователейСУО") Тогда
		ОтборыПользователейДляПоиска.Добавить(ОтборыПользователей);
	КонецЕсли;	
	
	Если ТипЗнч(ОтборыПользователей) = Тип("Массив") Тогда
		
		Для каждого ОтборПользователей Из ОтборыПользователей Цикл
			
			Если ОтборыПользователейДляПоиска.Найти(ОтборПользователей) = Неопределено Тогда
				ОтборыПользователейДляПоиска.Добавить(ОтборПользователей);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОтборыПользователей", ОтборыПользователейДляПоиска);	
	
	Если ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПричинаВозвратаНаДоработку", "АвтоматическиеРассылкиСУО.ПричинаВозвратаНаДоработку В(&ПричиныВозвратаНаДоработку)");
		ПричиныВозвратаНаДоработку = Новый Массив;
		ПричиныВозвратаНаДоработку.Добавить(Справочники.ПричиныВозвратаЗаданияНаДоработкуСУО.ПустаяСсылка());
		Если ЗначениеЗаполнено(ПричинаВозвратаНаДоработку) Тогда
			ПричиныВозвратаНаДоработку.Добавить(ПричинаВозвратаНаДоработку);
		КонецЕсли;
		Запрос.УстановитьПараметр("ПричиныВозвратаНаДоработку", ПричиныВозвратаНаДоработку);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПричинаВозвратаНаДоработку", "Истина");		
	КонецЕсли;		
	
	// Выбираем автоматические рассылки
	
	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Неопределено; // Нет подходящих автоматических рассылок
	КонецЕсли;
	
	ТаблицаАвтоРассылок = Результат.Выгрузить();	
	
	// Из выбранного множества рассылок подходящего типа
	// выбираем подходящую с учетом ограничений на виды обучения.
	// Важен порядок поиска: от частного к общему.
	
	ЭлементыПоиска = Новый Структура("
	    |ПроведениеПрограммыОбучения,
		|ПрограммаОбучения,
		|ПроведениеОбучения,
		|Мероприятие,
		|ВидМероприятия",
		ПроведениеПрограммыОбучения,
		ПрограммаОбучения,
		ПроведениеОбучения,
		Мероприятие,
		ВидМероприятия
	);
	
	НайденныеРассылки = Новый Массив;
	
	Для каждого ЭлементПоиска Из ЭлементыПоиска Цикл
		
		Если НЕ ЗначениеЗаполнено(ЭлементПоиска.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеРассылки = ТаблицаАвтоРассылок.НайтиСтроки(Новый Структура(ЭлементПоиска.Ключ, ЭлементПоиска.Значение));
		
		Если НайденныеРассылки.Количество() = 0 Тогда
			Продолжить;
		Иначе
			Прервать; // Рассылка найдена, заканчиваем
		КонецЕсли;
		
	КонецЦикла;	
	
	Если НайденныеРассылки.Количество() = 0 Тогда		
		
		// ВАЖНО: при введении новых ограничений, ввести их в этот отбор,
		// так как, если не найдена рассылка с ограничениями, надо искать
		// вообще без ограничений. Она имеет наименьшую важность.
		
		НайденныеРассылки = ТаблицаАвтоРассылок.НайтиСтроки(
			Новый Структура("ПроведениеПрограммыОбучения,
				|ПрограммаОбучения,
				|Мероприятие,
				|ВидМероприятия,
				|ПроведениеОбучения",
			    Документы.ПроведениеПрограммыОбученияСУО.ПустаяСсылка(),
				Справочники.КаталогПрограммОбученияСУО.ПустаяСсылка(),
				Справочники.КаталогМероприятийСУО.ПустаяСсылка(),
				Справочники.ВидыМероприятийСУО.ПустаяСсылка(),
				Документы.ПроведениеОбученияСУО.ПустаяСсылка())
		);		
		
	КонецЕсли;	
	
	Если ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания
		И НайденныеРассылки.Количество() > 0 Тогда
		
		ПодходящаяСтрока = Неопределено;
		
		Для каждого Строка Из НайденныеРассылки Цикл		
			Если Строка.ПричинаВозвратаНаДоработку = ПричинаВозвратаНаДоработку Тогда
				ПодходящаяСтрока = Строка;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если ПодходящаяСтрока = Неопределено Тогда
			Для каждого Строка Из НайденныеРассылки Цикл		
				Если Строка.ПричинаВозвратаНаДоработку = Справочники.ПричиныВозвратаЗаданияНаДоработкуСУО.ПустаяСсылка() Тогда
					ПодходящаяСтрока = Строка;
					Прервать;
				КонецЕсли;		
			КонецЦикла;
		КонецЕсли;
			
		Если ПодходящаяСтрока = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			НайденныеРассылки = Новый Массив;
			НайденныеРассылки.Добавить(ПодходящаяСтрока);
		КонецЕсли;
		
	КонецЕсли;		
	
	Если НайденныеРассылки.Количество() > 1 Тогда
		
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСТр("ru = 'ТипРассылки: %1
			|ПроведениеПрограммыОбучения: %2
			|ПрограммаОбучения: %3
			|ПроведениеОбучения: %4
			|Мероприятие: %5
			|ВидМероприятия: %6'"),
			ТипАвтоРассылки,
			ПроведениеПрограммыОбучения,
			ПрограммаОбучения,
			ПроведениеОбучения,
			Мероприятие,
			ВидМероприятия);
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическая рассылка.Найдено более одной автоматической рассылки'"), 
			УровеньЖурналаРегистрации.Ошибка,,НайденныеРассылки, ОписаниеОшибки);
			
		// Может быть найдено более двух правил, если указаны правила для
		// нескольких организаторов. Например, указано правило без организатора
		// и правило с организатором. Тогда будет ошибка. Следует, либо точно
		// разделить правила автоматических рассылок по организаторам, чтобы
		// они не пересекались, либо использовать одно правило для всех.
		// Ошибка не препятстствует созданию рассылки, но будет взято первое
		// правило, что может не соответствовать ожиданиям пользователя.			
		
	КонецЕсли;		
	
	НайденнаяСтрока = Неопределено;
	
	Если НайденныеРассылки.Количество() > 0 Тогда
		НайденнаяСтрока = НайденныеРассылки[0];
	КонецЕсли;	
	
	// Возвращаем результат
	
	Если НайденнаяСтрока = Неопределено Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		РезультатСтруктура = Новый Структура;
		РезультатСтруктура.Вставить("Шаблон", НайденнаяСтрока.Шаблон);
		РезультатСтруктура.Вставить("ШаблонСообщенияАдминистратору", НайденнаяСтрока.ШаблонСообщенияАдминистратору);
		РезультатСтруктура.Вставить("Администратор", НайденнаяСтрока.Администратор);
		РезультатСтруктура.Вставить("ТолькоЭлектроннаяПочта", НайденнаяСтрока.ТолькоЭлектроннаяПочта);
		РезультатСтруктура.Вставить("ШаблонСообщенияПреподавателям", НайденнаяСтрока.ШаблонСообщенияПреподавателям);
		РезультатСтруктура.Вставить("ШаблонСообщенияОрганизаторам", НайденнаяСтрока.ШаблонСообщенияОрганизаторам);
		РезультатСтруктура.Вставить("ОтборПользователей", НайденнаяСтрока.ОтборПользователей);
		РезультатСтруктура.Вставить("КоличествоЧасов", НайденнаяСтрока.КоличествоЧасов);
		РезультатСтруктура.Вставить("АльтернативныйШаблон", НайденнаяСтрока.АльтернативныйШаблон);
		РезультатСтруктура.Вставить("АльтернативнаяЭлектроннаяПочта", НайденнаяСтрока.АльтернативнаяЭлектроннаяПочта);
		РезультатСтруктура.Вставить("ПрикреплятьФайлы", НайденнаяСтрока.ПрикреплятьФайлы);
		
		СтруктураЗаписи = Новый Структура();
		СтруктураЗаписи.Вставить("Тип", НайденнаяСтрока.Тип);
		СтруктураЗаписи.Вставить("ВидМероприятия", НайденнаяСтрока.ВидМероприятия);
		СтруктураЗаписи.Вставить("Мероприятие", НайденнаяСтрока.Мероприятие);
		СтруктураЗаписи.Вставить("ПроведениеОбучения", НайденнаяСтрока.ПроведениеОбучения);
		СтруктураЗаписи.Вставить("ПрограммаОбучения", НайденнаяСтрока.ПрограммаОбучения);
		СтруктураЗаписи.Вставить("ПроведениеПрограммыОбучения", НайденнаяСтрока.ПроведениеПрограммыОбучения);
		СтруктураЗаписи.Вставить("Организатор", НайденнаяСтрока.Организатор);
		СтруктураЗаписи.Вставить("ОтборПользователей", НайденнаяСтрока.ОтборПользователей);
		СтруктураЗаписи.Вставить("ПричинаВозвратаНаДоработку", НайденнаяСтрока.ПричинаВозвратаНаДоработку);
		
		РезультатСтруктура.Вставить("КлючЗаписи", РегистрыСведений.АвтоматическиеРассылкиСУО.СоздатьКлючЗаписи(СтруктураЗаписи));
		
		Возврат РезультатСтруктура;	
		
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#КонецЕсли
